namespace Frontend.Models;

public static class IpaProvider
{
    // Extracted from Praat source (foned/TextGridArea.cpp)
    public static readonly string[,] Characters = {
        { "ɑ", "ɐ", "ɒ", "æ", "ʙ", "ɓ", "β", "ç", "ɕ", "ð" },
        { "ɗ", "ɖ", "ɛ", "ɜ", "ə", "ɢ", "ɠ", "ʛ", "ɣ", "ɤ" },
        { "ˠ", "ʜ", "ɦ", "ħ", "ʰ", "ɧ", "ɪ", "ɨ", "ı", "ɟ" },
        { "ʝ", "ʄ", "ᴊ", "ʲ", "ʟ", "ɬ", "ɭ", "ɮ", "ɫ", "ˡ" },
        { "ɰ", "ɯ", "ɱ", "ɴ", "ŋ", "ɲ", "ɳ", "ⁿ", "ɔ", "ɵ" },
        { "ø", "œ", "ɶ", "ɸ", "ɹ", "ʀ", "ʁ", "ɾ", "ɽ", "ɺ" },
        { "ɻ", "ʃ", "ʂ", "θ", "ʈ", "ʉ", "ʊ", "ʌ", "ʋ", "ʍ" },
        { "ʷ", "χ", "ʎ", "ʏ", "ɥ", "ʒ", "ʐ", "ʑ", "ˑ", "ː" },
        { "ʔ", "ʡ", "ʕ", "ʢ", "ˤ", "ǃ", "ʘ", "ǀ", "ǁ", "ǂ" },
        { "ʤ", "ɘ", "ɚ", "ɝ", "ʱ", "ˢ", "ʧ", "ɞ", "ʦ", "ʣ" },
        { "ʨ", "ʥ", "z̊", "z̥", "z̤", "z̰", "z̪", "z̩", "z̝", "z̞" },
        { "ý", "ȳ", "ỳ", "ÿ", "ỹ", "o̟", "o̱", "o̹", "o̜", "t̚" },
    };
}
